{
    "success": true,
    "news": {
        "total": 10000,
        "news": [
            {
                "_score": 1.1223122,
                "title": "Cincinnati weather: What's the forecast for St. Patrick's Day weekend?",
                "link": "https://www.cincinnati.com/story/weather/2024/03/15/cincinnati-weather-whats-the-forecast-for-st-patricks-day-weekend/72983491007/",
                "description": "After severe thunderstorms Thursday night, expect a relatively cool and dry St. Patrick's Day weekend.",
                "body": null,
                "source": "The Cincinnati Enquirer",
                "date": "2024-03-15T11:21:48.000Z",
                "props": {
                    "title": "Cincinnati weather: What's in the forecast for St. Patrick's Day weekend? 🍀",
                    "description": "After severe thunderstorms Thursday night, expect a relatively cool and dry St. Patrick's Day weekend.",
                    "url": "https://www.cincinnati.com/story/weather/2024/03/15/cincinnati-weather-whats-the-forecast-for-st-patricks-day-weekend/72983491007/",
                    "site_name": "The Enquirer",
                    "image": "https://www.cincinnati.com/gcdn/presto/2023/03/11/PCIN/344e92da-dfe0-4979-8bea-0719b66f2d8d-3-11-23_St._Patrick_Day_Parade5.JPG?crop=6015,3384,x0,y308&width=3200&height=1801&format=pjpg&auto=webp",
                    "image:width": "3200",
                    "image:height": "1801",
                    "type": "article"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:59.604Z",
                "hostname": "cincinnati.com",
                "id": "776164b4cf3f80f081d62157fe23fc67"
            },
            {
                "_score": 1.1226338,
                "title": "Power outages reported in the Highlands Thursday night after severe weather in Louisville | whas11.com",
                "link": "https://www.whas11.com/video/weather/severe-weather/power-outages-reported-in-the-highlands-thursday-night-after-severe-weather-in-louisville/417-cee0ce27-53dc-4725-a371-a6d9901594a7",
                "description": "",
                "body": null,
                "source": "WHAS11.com",
                "date": "2024-03-15T11:21:00.000Z",
                "props": {
                    "url": "https://www.whas11.com/video/weather/severe-weather/power-outages-reported-in-the-highlands-thursday-night-after-severe-weather-in-louisville/417-cee0ce27-53dc-4725-a371-a6d9901594a7",
                    "title": "Power outages reported in the Highlands Thursday night after severe weather in Louisville",
                    "description": "Power outages made it pitch black on several streets around Baxter Avenue Thursday night. Many businesses had to close early.",
                    "type": "video",
                    "image": "https://media.whas11.com/assets/WHAS/images/896fe959-dc4b-489f-9254-5c51c4c280ac/896fe959-dc4b-489f-9254-5c51c4c280ac_1140x641.jpg",
                    "image:width": "1140",
                    "image:height": "641",
                    "site_name": "whas11.com",
                    "locale": "en_US"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:59.480Z",
                "hostname": "whas11.com",
                "id": "243aa9d2a43ff38acd77130f5d7be7b7"
            },
            {
                "_score": 1.1239825,
                "title": "BItcoin price prediction: Here's how BTC could rebound to $80k",
                "link": "https://crypto.news/bitcoin-whales-buy-27-billion-btc-amid-8-price-dip-80k-rebound-ahead/",
                "description": "Bitcoin market analysis examines why BTC price tumbled 8% on March 15 and how institutional demand could drive a rebound towards $80,000.",
                "body": null,
                "source": "crypto.news",
                "date": "2024-03-15T11:20:39.000Z",
                "props": {
                    "locale": "en_US",
                    "type": "article",
                    "title": "BItcoin price prediction: Here's how BTC could rebound to $80k",
                    "description": "Bitcoin market analysis examines why BTC price tumbled 8% on March 15 and how institutional demand could drive a rebound towards $80,000.",
                    "url": "https://crypto.news/bitcoin-whales-buy-27-billion-btc-amid-8-price-dip-80k-rebound-ahead/",
                    "site_name": "crypto.news",
                    "image": "https://crypto.news/app/uploads/2024/02/crypto-news-Bitcoin-option45.webp",
                    "image:secure_url": "https://crypto.news/app/uploads/2024/02/crypto-news-Bitcoin-option45.webp",
                    "image:width": "1380",
                    "image:height": "824",
                    "image:alt": "Bitcoin",
                    "image:type": "image/webp"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:31.021Z",
                "hostname": "crypto.news",
                "id": "76b672222d959d8a30e24a7ab3c7c021"
            },
            {
                "_score": 1.1239825,
                "title": "What agriculture means to me  - High Plains Journal",
                "link": "https://hpj.com/2024/03/15/what-agriculture-means-to-me/",
                "description": "National Ag Week and Day are March 17 to 23 and March 19 respectively, and Kylene Scott shared her thoughts on what ag means to her.",
                "body": null,
                "source": "High Plains Journal",
                "date": "2024-03-15T11:20:12.000Z",
                "props": {
                    "locale": "en_US",
                    "type": "article",
                    "title": "What agriculture means to me  - High Plains Journal",
                    "description": "National Ag Week and Day are March 17 to 23 and March 19 respectively, and Kylene Scott shared her thoughts on what ag means to her.",
                    "url": "https://hpj.com/2024/03/15/what-agriculture-means-to-me/",
                    "site_name": "High Plains Journal",
                    "image": "https://hpj.com/wp-content/uploads/2024/03/IMG_9958-1sm-scaled.jpg",
                    "image:width": "2560",
                    "image:height": "1920",
                    "image:type": "image/jpeg"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:30:41.004Z",
                "hostname": "hpj.com",
                "id": "2304dd1764eb685169420466cb0af3e5"
            },
            {
                "_score": 1.1226338,
                "title": "Investing in Bitcoin’s Potential: The Rise of Groundbreaking Ventures | HackerNoon",
                "link": "https://hackernoon.com/investing-in-bitcoins-potential-the-rise-of-groundbreaking-ventures",
                "description": "Explore Bitcoin's evolution and the dynamic projects driving its future. Discover how the Bitcoin Frontier Fund is pioneering the blockchain revolution.",
                "body": "The Dawn of Innovation and Investment In 2023, a big breakthrough moved Bitcoin beyond its previous duties as a basic payment mechanism or digital currency. This creative approach not only extended Bitcoin&apos;s uses into new domains, but it also generated a flood of fresh ideas inside the Bitcoin community! Bitcoin was able to evolve beyond its traditional responsibilities. Within the realm of the art business, for instance, a digital artist used Bitcoin as the principal currency in order to create a unique collection of non-fungible tokens (NFTs). Clearly, this proves that the bitcoin market is conducive to the development of novel concepts and ideas! In the year 2023, this big innovation made it possible to investigate Bitcoin further and use it for a wider range of purposes beyond simply processing payments. The Bitcoin Frontier Fund (BFF) shined brilliantly during this turbulent era, providing support for the Ordinals project from the very beginning of its existence. The primary objective of the Bitcoin Foundation (BFF) was to investigate the potential of the enormous Bitcoin network and to provide support to those who were taking risks by entering the realm of blockchain technology. The creation of a series of digital art works was accomplished via the use of Bitcoin as the medium. This enabled people to experience and interact with the art in a variety of different ways. As a result of its inventive incorporation of Bitcoin and its one-of-a-kind approach to addressing mathematical issues, this outstanding example of a novel non-fungible token stands out as a major example. The Ordinals project, which is well-known for its innovative release of non-fungible tokens (NFTs) that addressed mathematical difficulties in ways that were compelling and motivating, received funding from the Bitcoin Frontier Fund. Consequently, this grabbed the interest of collectors and people who are passionate about technology, which led them to investigate the intersection of art and technology in more depth. BFF&apos;s Ordinals Accelerator: Igniting Innovation Ordinals-focused incubator was a first-of-its-kind initiative that was established by BFF in August 2023. The project&apos;s objective was to unite the strategic expertise of seasoned investors with the creative potential of Bitcoin developers. This was the first accelerator of its kind, and it heralded the beginning of a self-sustaining circular economy in Bitcoin that could only be paid for with Bitcoin cryptocurrency. This courageous step was a strategic change from seeing Bitcoin as only a means of storing money to considering the possibility that it may house a broad variety of applications that add value to the currency. During the course of the programme, artists and technical specialists collaborated on projects that were ground-breaking and innovative, and that pushed the boundaries of what Bitcoin technology was capable of doing. The combination of creative thinking and technological expertise resulted in the development of innovative decentralised applications that brought about a shift in the manner in which art was produced, purchased, and traded. It became abundantly evident, as a result of the success of the accelerator, that art and technology may collaborate to create new avenues for the expansion of the economy and for the transformation of culture. Beyond Bitcoin: Shaping the Future of Blockchain Technology BFF&apos;s initiatives go far beyond just Bitcoin, reaching into various aspects of our lives. By nurturing a wide range of apps and services, these investments highlight how blockchain can drive innovation in areas like digital finance, entertainment, and more. The teamwork among developers, investors, and users in BFF&apos;s community is redefining how blockchain shapes the digital world. As blockchain technology advances, BFF is leading us towards a future where decentralized systems become commonplace. Through backing diverse uses like secure transactions and transparent supply chains, BFF is showcasing how blockchain can improve lives beyond traditional cryptocurrencies. BFF&apos;s collaborative ecosystem is not just changing how we deal with digital assets; it&apos;s also molding the future of technology for all of us. Charting the Course for Blockchain&apos;s Next Frontier At this point in time, we are at the beginning of a new frontier in blockchain technology. We can see how the Bitcoin Frontier Fund and its collection of ground-breaking initiatives have altered everything when we look back at the journey that they have traveled together. The work that is being done by the Blockchain Foundation of America (BFF) and the visionary entrepreneurs that it supports is not only making Bitcoin more useful and simpler to get, but it is also preparing the way for a future in which blockchain technology will be a significant part of our digital lives, delivering solutions that are secure but open and inventive. The history of Bitcoin&apos;s evolution continues, revealing a promising future for the cryptocurrency that is full with opportunities that have not yet been uncovered. The fact that blockchain technology has the potential to totally transform a wide variety of industries is becoming more and more apparent as it continues to develop and evolve. Bitcoin and other decentralized technologies are causing a shift in consciousness about monetary systems, governments, and the protection of personal information. The Bitcoin Frontier Fund is providing financial assistance to enable these game-changing innovations. Moreover, they are altering the manner in which things are carried out in these regions. A growing number of innovative enterprises and concepts are using blockchain technology into their operations. This results in a future that is decentralized, efficient, and accessible to all individuals, as well as an expansion of the spectrum of possibilities that are available. The hunt for this new territory is still in its early stages; but, the individuals who are driving this movement to alter things have a vision and creativity that are ideally aligned with the countless choices that this new terrain provides. Don’t forget to like and share the story! This author is an independent contributor publishing via our brand-as-author program. Be it through direct compensation, media partnerships, or networking, the author has a vested interest in the company/ies mentioned in this story. HackerNoon has reviewed the report for quality, but the claims herein belong to the author. #DYOR Vested Interest Disclosure:",
                "source": "hackernoon.com",
                "date": "2024-03-15T11:19:50.000Z",
                "props": {
                    "title": "Investing in Bitcoin’s Potential: The Rise of Groundbreaking Ventures | HackerNoon",
                    "description": "Explore Bitcoin's evolution and the dynamic projects driving its future. Discover how the Bitcoin Frontier Fund is pioneering the blockchain revolution.",
                    "image": "https://hackernoon.imgix.net/images/7rEmNIeHNFOBfZZtUMQerOZIGGH3-tu8340y.jpeg?mark-pad=0&mark=http://hackernoon.imgix.net/HackerNoon%20Rounded%20Horizontal.png?w=400"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:30.671Z",
                "hostname": "hackernoon.com",
                "id": "a38a2263b3a7c33cbbfc7e9c3d681546"
            },
            {
                "_score": 1.1160421,
                "title": "17 Education & Technology Group Inc. to Report Fourth Quarter and Fiscal Year 2023 Unaudited Financial Results on March 20, 2024 - Technology Today - EIN Presswire",
                "link": "https://tech.einnews.com/pr_news/696191508/17-education-technology-group-inc-to-report-fourth-quarter-and-fiscal-year-2023-unaudited-financial-results-on-march-20-2024",
                "description": "17 Education & Technology Group Inc. (NASDAQ: YQ) (“17EdTech” or the “Company”), a leading education technology company in China, today announced that it will",
                "body": null,
                "source": "EIN News",
                "date": "2024-03-15T11:19:42.000Z",
                "props": {
                    "site_name": "EIN News",
                    "title": "17 Education & Technology Group Inc. to Report Fourth Quarter and Fiscal Year 2023 Unaudited Financial Results on March 20, 2024",
                    "url": "https://www.einnews.com/pr_news/696191508/17-education-technology-group-inc-to-report-fourth-quarter-and-fiscal-year-2023-unaudited-financial-results-on-march-20-2024",
                    "type": "article",
                    "description": "17 Education & Technology Group Inc. (NASDAQ: YQ) (“17EdTech” or the “Company”), a leading education technology company in China, today announced that it will",
                    "image": "https://ml.globenewswire.com/media/186b8e4e-adcc-4c27-a576-a9b460e94ebe/small/yq-us-company-logo-png.png",
                    "image:width": "150",
                    "image:height": "55"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:42.834Z",
                "hostname": "tech.einnews.com",
                "id": "47bc564a63deae32e1a06bb0e088505e"
            },
            {
                "_score": 1.1279678,
                "title": "‘Nothing is left’: A Brazilian city bears the environmental scars of salt mining",
                "link": "https://dialogochino.net/en/extractive-industries/391063-brazil-city-bears-environmental-scars-salt-mining/",
                "description": "After five decades of extraction in Maceió, houses sink and crack, and fishers struggle. A new investigation in congress may bring justice",
                "body": null,
                "source": "Diálogo Chino",
                "date": "2024-03-15T11:19:11.000Z",
                "props": {
                    "locale": "en_US",
                    "type": "article",
                    "title": "‘Nothing is left’: A Brazilian city bears the environmental scars of salt mining",
                    "description": "After five decades of extraction in Maceió, houses sink and crack, and fishers struggle. A new investigation in congress may bring justice",
                    "url": "https://dialogochino.net/en/extractive-industries/391063-brazil-city-bears-environmental-scars-salt-mining/",
                    "site_name": "Dialogo Chino",
                    "image": "https://dialogochino.net/content/uploads/2024/03/Braskem-chemical-companys-salt-tunnel_Alamy_2TC97J6-1-scaled-e1710415552325.jpg",
                    "image:width": "1200",
                    "image:height": "800"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:36:38.061Z",
                "hostname": "dialogochino.net",
                "id": "4fc27a898cff4b78ca4d868575e5097f"
            },
            {
                "_score": 1.1239825,
                "title": "Big 12 Tournament: Baylor vs. Iowa State odds, picks and predictions",
                "link": "https://sportsbookwire.usatoday.com/2024/03/15/big-12-tournament-baylor-vs-iowa-state-odds-picks-and-predictions/",
                "description": "Analyzing Friday's Big 12 Tournament: Baylor vs. Iowa State odds and lines, with college basketball expert picks, predictions and best bets.",
                "body": null,
                "source": "USA TODAY Sportsbook Wire",
                "date": "2024-03-15T11:18:33.000Z",
                "props": {
                    "type": "article",
                    "title": "Big 12 Tournament: Baylor vs. Iowa State odds, picks and predictions",
                    "url": "https://sportsbookwire.usatoday.com/2024/03/15/big-12-tournament-baylor-vs-iowa-state-odds-picks-and-predictions/",
                    "description": "Analyzing Friday’s Big 12 Tournament: Baylor vs. Iowa State odds and lines, with college basketball expert picks, predictions and best bets.",
                    "site_name": "USA TODAY Sportsbook Wire",
                    "image": "https://sportsbookwire.usatoday.com/wp-content/uploads/sites/16/2024/03/USATSI_22440093.jpg?w=1024&h=576&crop=1",
                    "image:width": "1024",
                    "image:height": "576",
                    "image:alt": "Iowa State Cyclones forward Hason Ward (24) drives to the basket against Baylor Bears guard Jayden Nunn (2).",
                    "locale": "en_US"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:03.389Z",
                "hostname": "sportsbookwire.usatoday.com",
                "id": "6221d430b713ae41f14ce49b84a618bf"
            },
            {
                "_score": 1.1228733,
                "title": "Promoting sustainable intermodal transport in Europe: sennder partners with Mercitalia | trans.info",
                "link": "https://trans.info/en/sennder-partners-with-mercitalia-381907",
                "description": "\nThe collaboration between sennder, Mercitalia and Poste Italiane represents a move towards integrating rail and road transport to optimise efficiency, reduce c...",
                "body": null,
                "source": "trans.info/en",
                "date": "2024-03-15T11:18:29.000Z",
                "props": {
                    "type": "website",
                    "locale": "en",
                    "site_name": "Trans.INFO",
                    "title": "Promoting sustainable intermodal transport in Europe: sennder partners with Mercitalia",
                    "description": "\nThe collaboration between sennder, Mercitalia and Poste Italiane represents a move towards integrating rail and road transport to optimise efficiency, reduce c...",
                    "url": "https://trans.info/en/sennder-partners-with-mercitalia-381907",
                    "image": "https://cdn-trans.info/uploads/2024/03/6365dfee35c619c98ca9caa926c.jpg",
                    "image:alt": "Promoting sustainable intermodal transport in Europe: sennder partners with Mercitalia",
                    "image:width": "1024",
                    "image:height": "581"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:30:08.934Z",
                "hostname": "trans.info",
                "id": "b682bc1c9c831d25dd4d41bbd6a27605"
            },
            {
                "_score": 1.1192572,
                "title": "Rx Rundown: Merck, Coherus BioSciences, Boehringer Ingelheim and more",
                "link": "https://www.mmm-online.com/home/channel/rx-rundown-merck-coherus-biosciences-boehringer-ingelheim-and-more/",
                "description": "Check out this week’s medical marketing news, people on the move and industry chatter.",
                "body": null,
                "source": "MM+M Online",
                "date": "2024-03-15T11:18:17.000Z",
                "props": {
                    "locale": "en_US",
                    "type": "article",
                    "title": "Rx Rundown: Merck, Coherus BioSciences, Boehringer Ingelheim and more",
                    "description": "Check out this week’s medical marketing news, people on the move and industry chatter.",
                    "url": "https://www.mmm-online.com/home/channel/rx-rundown-merck-coherus-biosciences-boehringer-ingelheim-and-more/",
                    "site_name": "MM+M - Medical Marketing and Media",
                    "image": "https://www.mmm-online.com/wp-content/uploads/sites/2/2024/01/5-Things-Rx-Rundown_Jan-2024_Web-Art-fin-002-1280x900-1.png",
                    "image:width": "1024",
                    "image:height": "683",
                    "image:type": "image/png"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:26:45.049Z",
                "hostname": "mmm-online.com",
                "id": "41afa7c06d7a9db99f23133c5dd2b077"
            },
            {
                "_score": 1.1177095,
                "title": "\n      At Least 16 Migrants Dead In Aegean Sea: Turkish State Media | Barron's\n    ",
                "link": "https://www.barrons.com/news/at-least-16-migrants-dead-in-aegean-sea-turkish-state-media-3bef677e",
                "description": "At least 16 migrants drowned after a boat capsized off the Turkish coast in the Aegean Sea, state media reported on Friday, citing local officials at the scene.",
                "body": null,
                "source": "Barron's",
                "date": "2024-03-15T11:18:01.000Z",
                "props": {
                    "title": "At Least 16 Migrants Dead In Aegean Sea: Turkish State Media",
                    "description": "At least 16 migrants drowned after a boat capsized off the Turkish coast in the Aegean Sea, state media reported on Friday, citing local officials at the scene.",
                    "url": "https://www.barrons.com/news/at-least-16-migrants-dead-in-aegean-sea-turkish-state-media-3bef677e",
                    "image": "https://asset.barrons.com/barrons/images/afp-metadata-default.jpg",
                    "image:width": "1280",
                    "image:height": "640",
                    "locale": "en_US",
                    "type": "article"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:33:12.971Z",
                "hostname": "barrons.com",
                "id": "b2a0e8f75aa0e6736dc72c33768f996c"
            },
            {
                "_score": 1.1218914,
                "title": "Tesla wants to hire someone to eliminate need for its EVs to get service | Electrek",
                "link": "https://electrek.co/2024/03/15/tesla-hire-eliminate-service/",
                "description": null,
                "body": null,
                "source": "Electrek",
                "date": "2024-03-15T11:17:42.000Z",
                "props": {
                    "locale": "en_US",
                    "type": "article",
                    "title": "Tesla wants to hire someone to eliminate need for its EVs to get service",
                    "description": "Tesla is in search of a new senior manager who will focus on eliminating the need for the automaker’s service....",
                    "url": "https://electrek.co/2024/03/15/tesla-hire-eliminate-service/",
                    "site_name": "Electrek",
                    "image": "https://i0.wp.com/electrek.co/wp-content/uploads/sites/3/2019/06/Tesla-Service-hero.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
                    "image:width": "1200",
                    "image:height": "600",
                    "image:type": "image/jpeg"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:34:16.342Z",
                "hostname": "electrek.co",
                "id": "ad67300fb56994187bb70b8d98220b45"
            },
            {
                "_score": 1.1131139,
                "title": "SatixFy Showcases Next-Gen Space Chip Technology",
                "link": "https://www.spacedaily.com/reports/SatixFy_Showcases_Next_Gen_Space_Chip_Technology_999.html",
                "description": "London, UK (SPX) Mar 15, 2024 - \nSatixFy Communications Ltd. (NYSE AMERICAN: SATX), a pioneering force in satellite communication technologies, has moved its Prime 2.0 Digital Beamformer (DBF) chip and Sx4000 Digital Payload On-Boa",
                "body": null,
                "source": "Space Daily",
                "date": "2024-03-15T11:17:40.000Z",
                "props": {
                    "title": "SatixFy Showcases Next-Gen Space Chip Technology",
                    "url": "https://www.spacedaily.com/reports/SatixFy_Showcases_Next_Gen_Space_Chip_Technology_999.html",
                    "type": "article",
                    "site_name": "Space Daily",
                    "image": "https://www.spxdaily.com/images-hg/satixfy-logo-hg.jpg"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:54.772Z",
                "hostname": "spacedaily.com",
                "id": "3f14e252a68550c04f6829c0e0472ab9"
            },
            {
                "_score": 1.1249888,
                "title": "Pornhub blocks Texas accessing site over age verification law",
                "link": "https://www.washingtonblade.com/2024/03/15/pornhub-blocks-texas-accessing-site-over-age-verification-law/?utm_source=rss&utm_medium=rss&utm_campaign=pornhub-blocks-texas-accessing-site-over-age-verification-law",
                "description": null,
                "body": null,
                "source": "Washington Blade",
                "date": "2024-03-15T11:16:34.000Z",
                "props": {
                    "type": "article",
                    "image": "https://www.washingtonblade.com/content/files/2024/03/PornHub-18-graphic.jpg",
                    "url": "https://www.washingtonblade.com/2024/03/15/pornhub-blocks-texas-accessing-site-over-age-verification-law/",
                    "title": "Pornhub blocks Texas accessing site over age verification law",
                    "description": "The Fifth Circuit Court of appeals partially vacated the original injunction ruling that the age verification requirements are constitutional",
                    "locale": "en_US",
                    "site_name": "Washington Blade: LGBTQ News, Politics, LGBTQ Rights, Gay News",
                    "image:width": "1149",
                    "image:height": "750",
                    "image:type": "image/jpeg"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:27:39.982Z",
                "hostname": "washingtonblade.com",
                "id": "b78b8656ed5253258b46a6efd0420848"
            },
            {
                "_score": 1.1177095,
                "title": "Media Statement 15 March 2024 | Bayobab Group Acknowledges Connectivity Disruptions Due to Undersea Cable Damage | MTN.com",
                "link": "https://www.mtn.com/media-statement-15-march-2024-bayobab-group-acknowledges-connectivity-disruptions-due-to-undersea-cable-damage/",
                "description": "MTN Group's Bayobab is working with its partners on the coordination of repair work to damaged underwater digital communication cables along the West",
                "body": null,
                "source": "MTN Group",
                "date": "2024-03-15T11:15:57.000Z",
                "props": {
                    "locale": "en_US",
                    "type": "article",
                    "title": "Media Statement 15 March 2024 | Bayobab Group Acknowledges Connectivity Disruptions Due to Undersea Cable Damage | MTN.com",
                    "description": "MTN Group's Bayobab is working with its partners on the coordination of repair work to damaged underwater digital communication cables along the West",
                    "url": "https://www.mtn.com/media-statement-15-march-2024-bayobab-group-acknowledges-connectivity-disruptions-due-to-undersea-cable-damage/",
                    "site_name": "MTN.com",
                    "image": "https://www.mtn.com/wp-content/uploads/2024/03/MicrosoftTeams-image-59.png",
                    "image:width": "1871",
                    "image:height": "1610",
                    "image:type": "image/png"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:33:13.246Z",
                "hostname": "mtn.com",
                "id": "4da493ce8f5724d869ee21ffdd2aea81"
            },
            {
                "_score": 1.1223122,
                "title": "U.S.-funded broadcaster Radio Free Asia to exit Hong Kong ahead of new security law - The Globe and Mail",
                "link": "https://www.theglobeandmail.com/world/article-radio-free-asia-hong-kong-security-law/",
                "description": "RFA, which describes its mission as ‘bringing free press to closed societies,’ has long been a target of Chinese state media",
                "body": null,
                "source": "The Globe and Mail",
                "date": "2024-03-15T11:15:49.000Z",
                "props": {
                    "site_name": "The Globe and Mail",
                    "locale": "en_GB",
                    "title": "U.S.-funded broadcaster Radio Free Asia to exit Hong Kong ahead of new security law",
                    "url": "https://www.theglobeandmail.com/world/article-radio-free-asia-hong-kong-security-law/",
                    "description": "RFA, which describes its mission as ‘bringing free press to closed societies,’ has long been a target of Chinese state media",
                    "type": "article",
                    "image": "https://www.theglobeandmail.com/resizer/v2/NNIXHM4UBRDFHK2PIPLJYLN3QE.JPG?auth=cb53e9d6db1cc9359e2184ee2a3c535e4f2f1e6eff6afe82f6433ad0e18d9d7c&width=1200&height=800&quality=80",
                    "image:width": "1200",
                    "image:height": "800"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:07.669Z",
                "hostname": "theglobeandmail.com",
                "id": "ffd2f8722063dec039e0aa4551e35c0d"
            },
            {
                "_score": 1.1203921,
                "title": "Tracking a flood & severe weather threat in Houston today",
                "link": "https://www.click2houston.com/weather/2024/03/15/tracking-a-flood-severe-weather-threat-in-houston-today/",
                "description": "2\" sized hail is possible",
                "body": null,
                "source": "KPRC Click2Houston",
                "date": "2024-03-15T11:15:26.000Z",
                "props": {
                    "url": "https://www.click2houston.com/weather/2024/03/15/tracking-a-flood-severe-weather-threat-in-houston-today/",
                    "title": "Tracking a flood & severe weather threat in Houston today",
                    "type": "article",
                    "description": "2\" sized hail is possible",
                    "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/weather/hou_radar_metro_se.jpg",
                    "site_name": "KPRC",
                    "locale": "en_US"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:59.251Z",
                "hostname": "click2houston.com",
                "id": "c0ef1fa93b2e34fb76c34554d9175cca"
            },
            {
                "_score": 1.1179277,
                "title": "Tesla, Ford, Netflix and other major companies pay more to C-suite than in federal tax | Fortune",
                "link": "https://fortune.com/2024/03/15/tesla-netflix-ford-tax-ceo-pay/",
                "description": "“It’s no coincidence that some of the nation’s most notorious tax dodgers also pay their executives too much,” write the report’s authors, calling executive pay “out of control.” ",
                "body": null,
                "source": "Fortune",
                "date": "2024-03-15T11:13:45.000Z",
                "props": {
                    "url": "https://fortune.com/2024/03/15/tesla-netflix-ford-tax-ceo-pay/",
                    "type": "article",
                    "title": "The cult of tax efficiency: The totally legal way that Tesla, Ford, Netflix and dozens of other large companies use U.S. law to pay their C-suite more than Uncle Sam",
                    "description": "“It’s no coincidence that some of the nation’s most notorious tax dodgers also pay their executives too much,” write the report’s authors, calling executive pay “out of control.” ",
                    "site_name": "Fortune",
                    "image": "https://content.fortune.com/wp-content/uploads/2024/03/GettyImages-1852529507-e1710459145785.jpg?resize=1200,600",
                    "width": "1024",
                    "height": "683"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:34:16.367Z",
                "hostname": "fortune.com",
                "id": "d574154da67370fc5cc1d3f18eaf6931"
            },
            {
                "_score": 1.1218914,
                "title": "Walmart pilots 3D weaving technology with unspun",
                "link": "https://www.retail-insight-network.com/news/walmart-unspun-3d-weaving-technology/",
                "description": "US retailer Walmart has partnered with fashion and technology company unspun to pilot 3D weaving technology in garment production.",
                "body": null,
                "source": "Retail Insight Network",
                "date": "2024-03-15T11:13:20.000Z",
                "props": {
                    "locale": "en_US",
                    "type": "article",
                    "title": "Walmart pilots 3D weaving technology with unspun ",
                    "description": "US retailer Walmart has partnered with fashion and technology company unspun to pilot 3D weaving technology in garment production.",
                    "url": "https://www.retail-insight-network.com/news/walmart-unspun-3d-weaving-technology/",
                    "site_name": "Retail Insight Network",
                    "image": "https://www.retail-insight-network.com/wp-content/uploads/sites/18/2024/03/Walmart1.jpg",
                    "image:width": "1440",
                    "image:height": "810",
                    "image:type": "image/jpeg"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:32:43.246Z",
                "hostname": "retail-insight-network.com",
                "id": "8bbf7a06045fd8175b9cbba648861d15"
            },
            {
                "_score": 1.1223122,
                "title": "Sydney Sweeney stuns in another crystal-encrusted plunging neck gown | HELLO! ",
                "link": "https://www.hellomagazine.com/hfm/fashion-trends/515488/sydney-sweeney-crystal-encrusted-plunging-neck-gown/",
                "description": "Euphoria's Sydney Sweeney has stepped out in yet another jaw-dropping ensemble this week, and it honestly might be our favourite look to date. See photos",
                "body": null,
                "source": "HELLO!",
                "date": "2024-03-15T11:11:34.000Z",
                "props": {
                    "url": "https://www.hellomagazine.com/hfm/fashion-trends/515488/sydney-sweeney-crystal-encrusted-plunging-neck-gown/",
                    "title": "Sydney Sweeney stuns in another crystal-encrusted plunging neck gown",
                    "description": "Sydney has donned so many incredible looks over the last few weeks, we've honestly lost count",
                    "article:author": "https://www.hellomagazine.com/author/orion-scott/",
                    "image": "https://images.hellomagazine.com/horizon/landscape/cff41b13fd10-mollyddickson17104711883323995705817518347274430508.jpg?tx=c_fill%2Cw_1200",
                    "image:height": "675",
                    "image:width": "1200",
                    "type": "article",
                    "site_name": "HELLO!"
                },
                "language": "EN",
                "created_at": "2024-03-15T11:33:30.959Z",
                "hostname": "hellomagazine.com",
                "id": "5b43c25727b6c13f6c2a133d86014432"
            }
        ],
        "next_cursor": "eyJzb3J0IjpbMTcxMDUwMTA5NDAwMCwiNWI0M2MyNTcyN2I2YzEzZjZjMmExMzNkODYwMTQ0MzIiXX0="
    }
}